Hajime-Suzuki/nRF52_Arduino/boards.txt
# SoftDevice Menu
particle_xenon.menu.softdevice.s140v6=S140 6.1.1
particle_xenon.menu.softdevice.s140v6.build.sd_name=s140
particle_xenon.menu.softdevice.s140v6.build.sd_version=6.1.1
particle_xenon.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
particle_xenon.menu.debug.l0=Level 0 (Release)
particle_xenon.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
particle_xenon.menu.debug.l1=Level 1 (Error Message)
particle_xenon.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
particle_xenon.menu.debug.l2=Level 2 (Full Debug)
particle_xenon.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
particle_xenon.menu.debug.l3=Level 3 (Segger SystemView)
particle_xenon.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
particle_xenon.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -------------------------------------------------------
# 
# BLUEMICRO BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# 4x4 macropad nRF52832
# ----------------------------------

4x4macropad_nrf52832.name=4x4 Macropad (nRF52832)
4x4macropad_nrf52832.bootloader.tool=bootburn

# Upload
4x4macropad_nrf52832.upload.tool=nrfutil
4x4macropad_nrf52832.upload.protocol=nrfutil
4x4macropad_nrf52832.upload.use_1200bps_touch=false
4x4macropad_nrf52832.upload.wait_for_upload_port=false
4x4macropad_nrf52832.upload.native_usb=false
4x4macropad_nrf52832.upload.maximum_size=290816
4x4macropad_nrf52832.upload.maximum_data_size=52224

# Build
4x4macropad_nrf52832.build.mcu=cortex-m4
4x4macropad_nrf52832.build.f_cpu=64000000
4x4macropad_nrf52832.build.board=4X4MACROPAD_NRF52832
4x4macropad_nrf52832.build.core=nRF5
4x4macropad_nrf52832.build.variant=4x4macropad_nrf52832
4x4macropad_nrf52832.build.usb_manufacturer="BlueMicro"
4x4macropad_nrf52832.build.usb_product="4x4 Macropad nRF52832"
4x4macropad_nrf52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
4x4macropad_nrf52832.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
4x4macropad_nrf52832.menu.softdevice.s132v6=0.4.1 SoftDevice s132 6.1.1
4x4macropad_nrf52832.menu.softdevice.s132v6.build.sd_name=s132
4x4macropad_nrf52832.menu.softdevice.s132v6.build.bl_version=0.4.1
4x4macropad_nrf52832.menu.softdevice.s132v6.build.sd_version=6.1.1
4x4macropad_nrf52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# Debug Menu
4x4macropad_nrf52832.menu.debug.l0=Level 0 (Release)
4x4macropad_nrf52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
4x4macropad_nrf52832.menu.debug.l1=Level 1 (Error Message)
4x4macropad_nrf52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
4x4macropad_nrf52832.menu.debug.l2=Level 2 (Full Debug)
4x4macropad_nrf52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
4x4macropad_nrf52832.menu.debug.l3=Level 3 (Segger SystemView)
4x4macropad_nrf52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
4x4macropad_nrf52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# BlueMicro V2.0c nRF52832
# ----------------------------------

# ----------------------------------
# BlueMicro V2.1 nRF52832
# ----------------------------------
bluemicro2_1.name=BlueMicro 2.1 nRF52832
bluemicro2_1.bootloader.tool=bootburn

# Upload
bluemicro2_1.upload.tool=nrfutil
bluemicro2_1.upload.protocol=nrfutil
bluemicro2_1.upload.use_1200bps_touch=false
bluemicro2_1.upload.wait_for_upload_port=false
bluemicro2_1.upload.native_usb=false
bluemicro2_1.upload.maximum_size=290816
bluemicro2_1.upload.maximum_data_size=52224

# Build
bluemicro2_1.build.mcu=cortex-m4
bluemicro2_1.build.f_cpu=64000000
bluemicro2_1.build.board=NRF52832_BLUEMICRO2_1
bluemicro2_1.build.core=nRF5
bluemicro2_1.build.variant=bluemicro2_1
bluemicro2_1.build.usb_manufacturer="BlueMicro"
bluemicro2_1.build.usb_product="BlueMicro nRF52832"
bluemicro2_1.build.extra_flags=-DNRF52832_XXAA -DNRF52
bluemicro2_1.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
bluemicro2_1.menu.softdevice.s132v6=0.4.1 SoftDevice s132 6.1.1
bluemicro2_1.menu.softdevice.s132v6.build.sd_name=s132
bluemicro2_1.menu.softdevice.s132v6.build.bl_version=0.4.1
bluemicro2_1.menu.softdevice.s132v6.build.sd_version=6.1.1
bluemicro2_1.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# Debug Menu
bluemicro2_1.menu.debug.l0=Level 0 (Release)
bluemicro2_1.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
bluemicro2_1.menu.debug.l1=Level 1 (Error Message)
bluemicro2_1.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
bluemicro2_1.menu.debug.l2=Level 2 (Full Debug)
bluemicro2_1.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
bluemicro2_1.menu.debug.l3=Level 3 (Segger SystemView)
bluemicro2_1.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
bluemicro2_1.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# BlueMicro840 nRF52840
# ----------------------------------

bluemicro_nrf52840.name=BlueMicro nRF52840

# VID/PID for bootloader with/without UF2, Arduino
bluemicro_nrf52840.vid.0=0x1D50
bluemicro_nrf52840.pid.0=0x6160
bluemicro_nrf52840.vid.1=0x1D50
bluemicro_nrf52840.pid.1=0x6161 

# Upload
bluemicro_nrf52840.bootloader.tool=bootburn
bluemicro_nrf52840.upload.tool=nrfutil
bluemicro_nrf52840.upload.protocol=nrfutil
bluemicro_nrf52840.upload.use_1200bps_touch=true
bluemicro_nrf52840.upload.wait_for_upload_port=true
bluemicro_nrf52840.upload.maximum_size=815104
bluemicro_nrf52840.upload.maximum_data_size=237568

# Build
bluemicro_nrf52840.build.mcu=cortex-m4
bluemicro_nrf52840.build.f_cpu=64000000
bluemicro_nrf52840.build.board=BLUEMICRO_NRF52840
bluemicro_nrf52840.build.core=nRF5
bluemicro_nrf52840.build.variant=bluemicro_nrf52840
bluemicro_nrf52840.build.usb_manufacturer="bluemicro.jpconstantineau.com"
bluemicro_nrf52840.build.usb_product="BlueMicro"
bluemicro_nrf52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
bluemicro_nrf52840.build.ldscript=nrf52840_s140_v6.ld
bluemicro_nrf52840.build.vid=0x1D50
bluemicro_nrf52840.build.pid=0x6161

# SofDevice Menu
bluemicro_nrf52840.menu.softdevice.s140v6=SoftDevice 0.4.1 s140 6.1.1
bluemicro_nrf52840.menu.softdevice.s140v6.build.sd_name=s140
bluemicro_nrf52840.menu.softdevice.s140v6.build.bl_version=0.4.1
bluemicro_nrf52840.menu.softdevice.s140v6.build.sd_version=6.1.1
bluemicro_nrf52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

